app/Controllers/ProductController.php

    public function readProduct(){
        $products = $this->product->findAll();
---
SELECT *
FROM `products`

    public function getProduct($id){
        $product = $this->product->where('id', $id)->first();
---
SELECT *
FROM `products`
WHERE `id` = '1'
 LIMIT 1

    public function updateProduct($id){
        $nama_product = $this->request->getVar('nama_product');
        $description = $this->request->getVar('description');
        $data =[
            'nama_product' => $nama_product,
            'description' => $description
        ];
        $this->product->update($id, $data);
---
UPDATE `products` SET `nama_product` = 'angga', `description` = 'hdbj'
WHERE `products`.`id` IN ('1')

    public function deleteProduct($id){
        $this->product->delete($id);
---
DELETE FROM `products`
WHERE `id` IN ('1')